target/classes/shipped.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ecom="http://www.moduslink.com/ECommerceService">
   <soapenv:Header/>
   <soapenv:Body>
      <ecom:ReceiveCustomMessage>
         <!--Optional:-->
         <ecom:xmlDocument>
		<ICE_SHIP_CONF>
	<RECEIVER>RBDURES</RECEIVER>
	<QUOTES>
		<QUOTE_ID>57843321</QUOTE_ID>
		<PROGRAM>Web Sales</PROGRAM>
		<CUST_PO_NUM />
		<NOTE />
		<DESCRIPTION />
		<DISCOUNT>0</DISCOUNT>
		<STATUS>Invoiced</STATUS>
		<DATE_SENT>2016-12-19-00.21.55</DATE_SENT>
		<TOTAL_PRICE>12.89</TOTAL_PRICE>
		<SPLIT />
		<BACK_ORDER />
		<TOTAL_TAX>2.45</TOTAL_TAX>
		<TOTAL_SHIP>0</TOTAL_SHIP>
		<TOTAL_SERVICE>0</TOTAL_SERVICE>
		<INVOICE_ID>0702896446</INVOICE_ID>
		<INVOICE_SITE>SAP_FMS</INVOICE_SITE>
		<INVOICE_TYPE />
		<ORDER_ID>29274379</ORDER_ID>
		<ORDER_SITE>SAP6RQ1</ORDER_SITE>
		<WANTED_DELIVERY_DATE>2016-12-19-00.00.00</WANTED_DELIVERY_DATE>
		<CURRENCY_CODE>EUR</CURRENCY_CODE>
		<SHIP_COURIER />
		<RUSH_REASON />
		<RUSH_TYPE />
		<SHIP_SERVICE>11</SHIP_SERVICE>
		<FREIGHT_ACCOUNT />
		<TOTAL_AMOUNT>15.34</TOTAL_AMOUNT>
		<NON_INVENTORY />
		<ORDER_REF>RBDURES-00001011</ORDER_REF>
		<DATE_CREATED>2016-12-19-13.24.13</DATE_CREATED>
		<CONNECTED_OBJECTS>
			<CountryCode>DE</CountryCode>
			<LanguageCode>de</LanguageCode>
			<TRANSACTION_CHANNEL>8a82941847d450020147d4cf924c0153
			</TRANSACTION_CHANNEL>
			<CC_TRANS_ID>8a829449590371e301591707e6903a18</CC_TRANS_ID>
		</CONNECTED_OBJECTS>
		<NOTES />
		<ITEMS>
			<LINE>
				<LINE_NUMBER>1</LINE_NUMBER>
				<PROD_REL_NAME>10058891</PROD_REL_NAME>
				<QUANTITY>1</QUANTITY>
				<DISCOUNT />
				<DESCRIPTION>Druckstellen Pflaster - extra weich</DESCRIPTION>
				<PRICE>8.7</PRICE>
				<LINE_NOTE />
				<NON_INVENTORY />
				<CONNECTED_OBJECTS>
					<ORIGINAL_GROSS_PRICE>10.35</ORIGINAL_GROSS_PRICE>
					<VAT_FACTOR>1.19</VAT_FACTOR>
				</CONNECTED_OBJECTS>
			</LINE>
			<LINE>
				<LINE_NUMBER>2</LINE_NUMBER>
				<PROD_REL_NAME>RB_SHIPCOSTS</PROD_REL_NAME>
				<QUANTITY>1</QUANTITY>
				<DISCOUNT />
				<DESCRIPTION>RB_SHIPCOSTS</DESCRIPTION>
				<PRICE>4.19</PRICE>
				<LINE_NOTE />
				<NON_INVENTORY />
				<CONNECTED_OBJECTS>
					<ORIGINAL_GROSS_PRICE>4.99</ORIGINAL_GROSS_PRICE>
					<VAT_FACTOR>1.19</VAT_FACTOR>
				</CONNECTED_OBJECTS>
			</LINE>
		</ITEMS>
	</QUOTES>
	<CLIENT>RB</CLIENT>
	<CAMPAIGN>HYBRIS</CAMPAIGN>
	<PROGRAM>Web Sales</PROGRAM>
	<EVENT>SCHOLL</EVENT>
	<PERSONS>
		<FIRST_NAME>Sebastian</FIRST_NAME>
		<MIDDLE_NAME />
		<LAST_NAME>Baltruszwicz</LAST_NAME>
		<OFFICE_PHONE />
		<OFFICE_PHONE_AREA />
		<OFFICE_PHONE_COUNTRY />
		<OFFICE_PHONE_EXT />
		<FAX />
		<FAX_AREA />
		<FAX_COUNTRY />
		<HOME_PHONE>222</HOME_PHONE>
		<HOME_PHONE_AREA>+498969931</HOME_PHONE_AREA>
		<HOME_PHONE_COUNTRY />
		<EMAIL_ADDRESS>rbtest916@gmail.com</EMAIL_ADDRESS>
		<EXT_EMAIL_ADDRESS />
		<EMAIL_TYPE />
		<SALUTATION>NONE</SALUTATION>
		<TITLE />
		<JOB_FUNCTION />
		<NOTE />
		<CONT_PHONE />
		<CONT_MAIL />
		<CONT_FAX />
		<CONT_LETTER />
		<CONT_THIRD_PARTY />
		<NO_COMMS />
		<STATIC_ADDRESSES>
			<S_ADDRESS>
				<ADD_TYPE>Bill To</ADD_TYPE>
				<FIRST_NAME>Sebastian</FIRST_NAME>
				<MIDDLE_NAME />
				<LAST_NAME>Baltruszwicz</LAST_NAME>
				<TITLE />
				<ADDRESS1>Werner-Heisenberg-Allee 25</ADDRESS1>
				<ADDRESS2 />
				<ADDRESS3 />
				<ADDRESS4 />
				<ADDRESS5 />
				<CITY>München</CITY>
				<COUNTY />
				<COUNTRY>GERMANY</COUNTRY>
				<PROVINCE />
				<MAIL_STOP />
				<PO_BOX />
				<STATE />
				<ZIP>80939</ZIP>
				<COMPANY_NAME />
				<ISO2COUNTRYCODE>DE</ISO2COUNTRYCODE>
			</S_ADDRESS>
			<S_ADDRESS>
				<ADD_TYPE>Ship To</ADD_TYPE>
				<FIRST_NAME>Sebastian</FIRST_NAME>
				<MIDDLE_NAME />
				<LAST_NAME>Baltruszwicz</LAST_NAME>
				<TITLE />
				<ADDRESS1>Werner-Heisenberg-Allee 25</ADDRESS1>
				<ADDRESS2 />
				<ADDRESS3 />
				<ADDRESS4 />
				<ADDRESS5 />
				<CITY>München</CITY>
				<COUNTY />
				<COUNTRY>GERMANY</COUNTRY>
				<PROVINCE />
				<MAIL_STOP />
				<PO_BOX />
				<STATE />
				<ZIP>80939</ZIP>
				<COMPANY_NAME />
				<ISO2COUNTRYCODE>DE</ISO2COUNTRYCODE>
			</S_ADDRESS>
		</STATIC_ADDRESSES>
	</PERSONS>
	<HEADER>
		<ORDER_NO>29274379</ORDER_NO>
		<ORDER_COMPLETE>TRUE</ORDER_COMPLETE>
		<ORIG_KEY>57843321</ORIG_KEY>
		<ORIG_SYSTEM>APELVICT</ORIG_SYSTEM>
		<DATE_SHIPPED>2016-12-19-14.09.48</DATE_SHIPPED>
		<ROWCOUNT>1</ROWCOUNT>
		<CONSIGNMENT_ID>0822563520</CONSIGNMENT_ID>
		<CUSTOMER_NO>15332</CUSTOMER_NO>
		<SENDER_REFERENCE>2528155011</SENDER_REFERENCE>
		<CONSIGNEE_REFERENCE>2528155011</CONSIGNEE_REFERENCE>
		<FORWARD_AGENT_ID>DHL</FORWARD_AGENT_ID>
	</HEADER>
	<ROWS>
		<ROW1>
			<LINE_NO>1</LINE_NO>
			<REL_NO>1</REL_NO>
			<LINE_ITEM_NO>0</LINE_ITEM_NO>
			<QTY_SHIPPED>1</QTY_SHIPPED>
			<CATALOG_NO>000000000010058891</CATALOG_NO>
			<SHIPMENT_COMPLETE>TRUE</SHIPMENT_COMPLETE>
			<ORIG_SYSTEM>APELVICT</ORIG_SYSTEM>
			<ORIG_KEY>13258647</ORIG_KEY>
			<REAL_SHIP_DATE>19-Dec-2016</REAL_SHIP_DATE>
			<TRACKING_NUMBER>2528155011</TRACKING_NUMBER>
		</ROW1>
	</ROWS>
	<PARCELS>
		<PARCEL>
			<SHIP_DATE>2017-01-09-14.09.48</SHIP_DATE>
			<SHIP_METHOD>DHL</SHIP_METHOD>
			<TRACKING_NO>2528155011</TRACKING_NO>
			<ITEMS>
				<ITEM>
					<QUANTITY>1</QUANTITY>
					<LINE_NO>1</LINE_NO>
					<REL_NO>1</REL_NO>
					<LINE_ITEM_NO>1</LINE_ITEM_NO>
					<PART_NO>000000000010058891</PART_NO>
					<DESCRIPTION />
					<SERIAL_NUMBERS />
				</ITEM>
			</ITEMS>
		</PARCEL>
	</PARCELS>
	<Procedure>
		<Name />
		<Action>DO</Action>
		<Synchronous>FALSE</Synchronous>
	</Procedure>
	<OutMessageID>28217331</OutMessageID>
	<Receiver>RBDUR</Receiver>
	<ExternalRef>RBDURES-00001011</ExternalRef>
	<GlobalRef>57843321</GlobalRef>
	<MsgOrigin />
	<MsgTrackingId />
	<Origin>APELVICT</Origin>
	<OriginId>28217331</OriginId>
</ICE_SHIP_CONF>
 
 

    
     </ecom:xmlDocument>
      </ecom:ReceiveCustomMessage>
   </soapenv:Body>
</soapenv:Envelope>